lib/internal_crud_services/internal_crud_libs/features/feature_obj.rb

SELECT `services`.* FROM `services` WHERE `services`.`id` = 1 LIMIT 1
---
        def parent_record
          @parent_record = @parent_record || Service.find_by(id: params[:service_id])