lib/internal_crud_services/internal_crud_libs/services/service_obj.rb

        def derive_cdn_record(type_of_cdn)
          CdnObject.new(ServiceCdns.where(service_id: record.id).where(type_of_cdn: ).first , self) rescue nil
---
SELECT `service_cdns`.* FROM `service_cdns` WHERE `service_cdns`.`service_id` = 18 AND `service_cdns`.`type_of_cdn` = 'Mobile' ORDER BY `service_cdns`.`id` ASC LIMIT 1