app/controllers/features_controller.rb

INSERT INTO `features` (`name`, `service_id`, `created_at`, `updated_at`, `is_published`) VALUES ('feature_1', 1, '2023-06-18 06:20:08.055612', '2023-06-18 06:20:08.055612', FALSE)
---
  def create
    @feature_record = FeatureObj.new(create_params).create.record