app/controllers/mandatory_apps_controller.rb

INSERT INTO `mandatory_apps` (`name`, `service_id`, `is_public`, `created_at`, `updated_at`, `is_published`) VALUES ('mandatory_app_2', 1, FALSE, '2023-06-18 06:01:18.872228', '2023-06-18 06:01:18.872228', FALSE)
---
  def create
    @mandatory_app_record = MandatoryAppObj.new(create_params).create.record