app/controllers/services_controller.rb

INSERT INTO `services` (`name`, `created_at`, `updated_at`, `github_repo_name`, `is_mobile_or_web_or_both`, `is_web_published`, `is_app_published`) VALUES ('sample_1', '2023-06-17 05:12:27.999695', '2023-06-17 05:12:27.999695', 'sample_1-api', '0', FALSE, FALSE)
---
  def create
    render json: ServiceObj.new(create_params).create.record.as_json, status: 201