lib/internal_crud_services/internal_crud_libs/mandatory_apps/mandatory_app_obj.rb

        def parent_record
          @parent_record = @parent_record || Service.find_by(id: params[:service_id])
---
SELECT `services`.* FROM `services` WHERE `services`.`id` = 1 LIMIT 1